// + 1. Создать карточку товара
// +  1.1. Иконка открывающая окно редактиврования
// +  1.2. Придумать как загружать новое фото
//  1.3. 
//  2. "Все продукты" будут вмещать миникарточки товара, т.е. в шапке миникарточки будет указание имени товара, его рейтинга и ниже фото
// 3. В карточке просмотра продукта, надо добавить кнопку возможности добавления его в список из выпадающего окна или из модального окна
// 4. Добавить возможность создавать разные списки.
// 5. Тыкнув на фото в карточке продукта, оно должно открываться в модальном окне
// 6. Сохранять на сервер фотографий с названием времени в миллискеундах
// 7. Сделать сортировку по место покупок/имени/очереди добавления
// 8. История цен (дата + цена)
// 9. 